/**
 * Created by jialin on 2014/12/16.
 */
define(function(require,exports){
    /*build(remove.start)*/
    require('default/javascripts/plugins/i8city/i8city.css');
    require('default/javascripts/plugins/i8scrollbar/css/mscrollbar.css');
    require('default/javascripts/plugins/i8scrollbar/mscrollbar');
    /*build(remove.end)*/
    var lev1code=["00010011", "00010012", "00010013", "00010014", "00010015", "00010021", "00010022", "00010023", "00010031", "00010032", "00010033", "00010034", "00010035", "00010036", "00010037", "00010041", "00010042", "00010043", "00010044", "00010045", "00010046", "00010050", "00010051", "00010052", "00010053", "00010054", "00010061", "00010062", "00010063", "00010064", "00010065", "00010071"];
    var lev2code=[["000100110001", "000100110002", "000100110003", "000100110004", "000100110005", "000100110006", "000100110007", "000100110008", "000100110009", "000100110011", "000100110012", "000100110013", "000100110014", "000100110015", "000100110016", "000100110017", "000100110028", "000100110029"]
        ,["000100120001", "000100120002", "000100120003", "000100120004", "000100120005", "000100120006", "000100120007", "000100120008", "000100120009", "000100120010", "000100120011", "000100120012", "000100120013", "000100120014", "000100120015", "000100120021", "000100120023", "000100120025"]
        ,["000100130001", "000100130002", "000100130003", "000100130004", "000100130005", "000100130006", "000100130007", "000100130008", "000100130009", "000100130010", "000100130011"]
        ,["000100140001", "000100140002", "000100140003", "000100140004", "000100140005", "000100140006", "000100140007", "000100140008", "000100140009", "000100140010", "000100140023"]
        ,["000100150001", "000100150002", "000100150003", "000100150004", "000100150005", "000100150006", "000100150007", "000100150022", "000100150025", "000100150026", "000100150028", "000100150029"]
        ,["000100210001", "000100210002", "000100210003", "000100210004", "000100210005", "000100210006", "000100210007", "000100210008", "000100210009", "000100210010", "000100210011", "000100210012", "000100210013", "000100210014"]
        ,["000100220001", "000100220002", "000100220003", "000100220004", "000100220005", "000100220006", "000100220007", "000100220008", "000100220024"]
        ,["000100230001", "000100230002", "000100230003", "000100230004", "000100230005", "000100230006", "000100230007", "000100230008", "000100230009", "000100230010", "000100230011", "000100230012", "000100230027"]
        ,["000100310001", "000100310003", "000100310004", "000100310005", "000100310006", "000100310007", "000100310008", "000100310009", "000100310010", "000100310012", "000100310013", "000100310014", "000100310015", "000100310016", "000100310017", "000100310018", "000100310019", "000100310020", "000100310030"]
        ,["000100320001", "000100320002", "000100320003", "000100320004", "000100320005", "000100320006", "000100320007", "000100320008", "000100320009", "000100320010", "000100320011", "000100320012", "000100320013"]
        ,["000100330001", "000100330002", "000100330003", "000100330004", "000100330005", "000100330006", "000100330007", "000100330008", "000100330009", "000100330010", "000100330011"]
        ,["000100340001", "000100340002", "000100340003", "000100340004", "000100340005", "000100340006", "000100340007", "000100340008", "000100340010", "000100340011", "000100340012", "000100340013", "000100340014", "000100340015", "000100340016", "000100340017", "000100340018"]
        ,["000100350001", "000100350002", "000100350003", "000100350004", "000100350005", "000100350006", "000100350007", "000100350008", "000100350009"]
        ,["000100360001", "000100360002", "000100360003", "000100360004", "000100360005", "000100360006", "000100360007", "000100360008", "000100360009", "000100360010", "000100360011"]
        ,["000100370001", "000100370002", "000100370003", "000100370004", "000100370005", "000100370006", "000100370007", "000100370008", "000100370009", "000100370010", "000100370011", "000100370012", "000100370013", "000100370014", "000100370015", "000100370016", "000100370017"]
        ,["000100410001", "000100410002", "000100410003", "000100410004", "000100410005", "000100410006", "000100410007", "000100410008", "000100410009", "000100410010", "000100410011", "000100410012", "000100410013", "000100410014", "000100410015", "000100410016", "000100410017"]
        ,["000100420001", "000100420002", "000100420003", "000100420005", "000100420006", "000100420007", "000100420008", "000100420009", "000100420010", "000100420011", "000100420012", "000100420013", "000100420028", "000100420090"]
        ,["000100430001", "000100430002", "000100430003", "000100430004", "000100430005", "000100430006", "000100430007", "000100430008", "000100430009", "000100430010", "000100430011", "000100430012", "000100430013", "000100430031"]
        ,["000100440001", "000100440002", "000100440003", "000100440004", "000100440005", "000100440006", "000100440007", "000100440008", "000100440009", "000100440012", "000100440013", "000100440014", "000100440015", "000100440016", "000100440017", "000100440018", "000100440019", "000100440020", "000100440051", "000100440052", "000100440053"]
        ,["000100450001", "000100450002", "000100450003", "000100450004", "000100450005", "000100450006", "000100450007", "000100450008", "000100450009", "000100450010", "000100450011", "000100450012", "000100450013", "000100450014"]
        ,["000100460001", "000100460002", "000100460090"]
        ,["000100500001", "000100500002", "000100500003", "000100500004", "000100500005", "000100500006", "000100500007", "000100500008", "000100500009", "000100500010", "000100500011", "000100500012", "000100500013", "000100500014", "000100500015", "000100500022", "000100500023", "000100500024", "000100500025", "000100500026", "000100500027", "000100500028", "000100500029", "000100500030", "000100500031", "000100500032", "000100500033", "000100500034", "000100500035", "000100500036", "000100500037", "000100500038", "000100500040", "000100500041", "000100500042", "000100500043", "000100500081", "000100500082", "000100500083", "000100500084"]
        ,["000100510001", "000100510003", "000100510004", "000100510005", "000100510006", "000100510007", "000100510008", "000100510009", "000100510010", "000100510011", "000100510013", "000100510014", "000100510015", "000100510016", "000100510017", "000100510018", "000100510019", "000100510020", "000100510032", "000100510033", "000100510034"]
        ,["000100520001", "000100520002", "000100520003", "000100520004", "000100520022", "000100520023", "000100520024", "000100520026", "000100520027"]
        ,["000100530001", "000100530003", "000100530004", "000100530005", "000100530006", "000100530007", "000100530023", "000100530025", "000100530026", "000100530027", "000100530028", "000100530029", "000100530031", "000100530033", "000100530034", "000100530035"]
        ,["000100540001", "000100540021", "000100540022", "000100540023", "000100540024", "000100540025", "000100540026"]
        ,["000100610001", "000100610002", "000100610003", "000100610004", "000100610005", "000100610006", "000100610007", "000100610008", "000100610009", "000100610010"]
        ,["000100620001", "000100620002", "000100620003", "000100620004", "000100620005", "000100620006", "000100620007", "000100620008", "000100620009", "000100620010", "000100620024", "000100620026", "000100620029", "000100620030"]
        ,["000100630001", "000100630021", "000100630022", "000100630023", "000100630025", "000100630026", "000100630027", "000100630028"]
        ,["000100640001", "000100640002", "000100640003", "000100640004"]
        ,["000100650001", "000100650002", "000100650021", "000100650022", "000100650023", "000100650027", "000100650028", "000100650029", "000100650030", "000100650031", "000100650032", "000100650040", "000100650042", "000100650043", "000100650090"]
        ,["000100710001"]
    ]
    var lev1=["北京市", "天津市", "河北省", "山西省", "内蒙古自治区", "辽宁省", "吉林省", "黑龙江省", "上海市", "江苏省", "浙江省", "安徽省", "福建省", "江西省", "山东省", "河南省", "湖北省", "湖南省", "广东省", "广西壮族自治区", "海南省", "重庆市", "四川省", "贵州省", "云南省", "西藏自治区", "陕西省", "甘肃省", "青海省", "宁夏回族自治区", "新疆维吾尔族自治区", "其它"]
    var lev2=[["东城区", "西城区", "崇文区", "宣武区", "朝阳区", "丰台区", "石景山区", "海淀区", "门头沟区", "房山区", "通州区", "顺义区", "昌平区", "大兴区", "怀柔区", "平谷区", "密云县", "延庆县"]
    ,["和平区", "河东区", "河西区", "南开区", "河北区", "红桥区", "塘沽区", "汉沽区", "大港区", "东丽区", "西青区", "津南区", "北辰区", "武清区", "宝坻区", "宁河县", "静海县", "蓟　县"]
    ,["石家庄市", "唐山市", "秦皇岛市", "邯郸市", "邢台市", "保定市", "张家口市", "承德市", "沧州市", "廊坊市", "衡水市"]
    ,["太原市", "大同市", "阳泉市", "长治市", "晋城市", "朔州市", "晋中市", "运城市", "忻州市", "临汾市", "吕梁地区"]
    ,["呼和浩特市", "包头市", "乌海市", "赤峰市", "通辽市", "鄂尔多斯市", "呼伦贝尔市", "兴安盟", "锡林郭勒盟", "乌兰察布盟", "巴彦淖尔盟", "阿拉善盟"]
    ,["沈阳市", "大连市", "鞍山市", "抚顺市", "本溪市", "丹东市", "锦州市", "营口市", "阜新市", "辽阳市", "盘锦市", "铁岭市", "朝阳市", "葫芦岛市"]
    ,["长春市", "吉林市", "四平市", "辽源市", "通化市", "白山市", "松原市", "白城市", "延边朝鲜族自治州"]
    ,["哈尔滨市", "齐齐哈尔市", "鸡西市", "鹤岗市", "双鸭山市", "大庆市", "伊春市", "佳木斯市", "七台河市", "牡丹江市", "黑河市", "绥化市", "大兴安岭地区"]
    ,["黄浦区", "卢湾区", "徐汇区", "长宁区", "静安区", "普陀区", "闸北区", "虹口区", "杨浦区", "闵行区", "宝山区", "嘉定区", "浦东新区", "金山区", "松江区", "青浦区", "南汇区", "奉贤区", "崇明县"]
    ,["南京市", "无锡市", "徐州市", "常州市", "苏州市", "南通市", "连云港市", "淮安市", "盐城市", "扬州市", "镇江市", "泰州市", "宿迁市"]
    ,["杭州市", "宁波市", "温州市", "嘉兴市", "湖州市", "绍兴市", "金华市", "衢州市", "舟山市", "台州市", "丽水市"]
    ,["合肥市", "芜湖市", "蚌埠市", "淮南市", "马鞍山市", "淮北市", "铜陵市", "安庆市", "黄山市", "滁州市", "阜阳市", "宿州市", "巢湖市", "六安市", "亳州市", "池州市", "宣城市"]
    ,["福州市", "厦门市", "莆田市", "三明市", "泉州市", "漳州市", "南平市", "龙岩市", "宁德市"]
    ,["南昌市", "景德镇市", "萍乡市", "九江市", "新余市", "鹰潭市", "赣州市", "吉安市", "宜春市", "抚州市", "上饶市"]
    ,["济南市", "青岛市", "淄博市", "枣庄市", "东营市", "烟台市", "潍坊市", "济宁市", "泰安市", "威海市", "日照市", "莱芜市", "临沂市", "德州市", "聊城市", "滨州市", "荷泽市"]
    ,["郑州市", "开封市", "洛阳市", "平顶山市", "安阳市", "鹤壁市", "新乡市", "焦作市", "濮阳市", "许昌市", "漯河市", "三门峡市", "南阳市", "商丘市", "信阳市", "周口市", "驻马店市"]
    ,["武汉市", "黄石市", "十堰市", "宜昌市", "襄樊市", "鄂州市", "荆门市", "孝感市", "荆州市", "黄冈市", "咸宁市", "随州市", "恩施土家族苗族自治州", "省直辖行政单位"]
    ,["长沙市", "株洲市", "湘潭市", "衡阳市", "邵阳市", "岳阳市", "常德市", "张家界市", "益阳市", "郴州市", "永州市", "怀化市", "娄底市", "湘西土家族苗族自治州"]
    ,["广州市", "韶关市", "深圳市", "珠海市", "汕头市", "佛山市", "江门市", "湛江市", "茂名市", "肇庆市", "惠州市", "梅州市", "汕尾市", "河源市", "阳江市", "清远市", "东莞市", "中山市", "潮州市", "揭阳市", "云浮市"]
    ,["南宁市", "柳州市", "桂林市", "梧州市", "北海市", "防城港市", "钦州市", "贵港市", "玉林市", "百色市", "贺州市", "河池市", "来宾市", "崇左市"]
    ,["海口市", "三亚市", "省直辖县级行政单位"]
    ,["万州区", "涪陵区", "渝中区", "大渡口区", "江北区", "沙坪坝区", "九龙坡区", "南岸区", "北碚区", "万盛区", "双桥区", "渝北区", "巴南区", "黔江区", "长寿区", "綦江县", "潼南县", "铜梁县", "大足县", "荣昌县", "璧山县", "梁平县", "城口县", "丰都县", "垫江县", "武隆县", "忠　县", "开　县", "云阳县", "奉节县", "巫山县", "巫溪县", "石柱土家族自治县", "秀山土家族苗族自治县", "酉阳土家族苗族自治县", "彭水苗族土家族自治县", "江津市", "合川市", "永川市", "南川市"]
    ,["成都市", "自贡市", "攀枝花市", "泸州市", "德阳市", "绵阳市", "广元市", "遂宁市", "内江市", "乐山市", "南充市", "眉山市", "宜宾市", "广安市", "达州市", "雅安市", "巴中市", "资阳市", "阿坝藏族羌族自治州", "甘孜藏族自治州", "凉山彝族自治州"]
    ,["贵阳市", "六盘水市", "遵义市", "安顺市", "铜仁地区", "黔西南布依族苗族自治州", "毕节地区", "黔东南苗族侗族自治州", "黔南布依族苗族自治州"]
    ,["昆明市", "曲靖市", "玉溪市", "保山市", "昭通市", "丽江市", "楚雄彝族自治州", "红河哈尼族彝族自治州", "文山壮族苗族自治州", "思茅地区", "西双版纳傣族自治州", "大理白族自治州", "德宏傣族景颇族自治州", "怒江傈僳族自治州", "迪庆藏族自治州", "临沧地区"]
    ,["拉萨市", "昌都地区", "山南地区", "日喀则地区", "那曲地区", "阿里地区", "林芝地区"]
    ,["西安市", "铜川市", "宝鸡市", "咸阳市", "渭南市", "延安市", "汉中市", "榆林市", "安康市", "商洛市"]
    ,["兰州市", "嘉峪关市", "金昌市", "白银市", "天水市", "武威市", "张掖市", "平凉市", "酒泉市", "庆阳市", "定西地区", "陇南地区", "临夏回族自治州", "甘南藏族自治州"]
    ,["西宁市", "海东地区", "海北藏族自治州", "黄南藏族自治州", "海南藏族自治州", "果洛藏族自治州", "玉树藏族自治州", "海西蒙古族藏族自治州"]
    ,["银川市", "石嘴山市", "吴忠市", "固原市"]
    ,["乌鲁木齐市", "克拉玛依市", "吐鲁番地区", "哈密地区", "昌吉回族自治州", "博尔塔拉蒙古自治州", "巴音郭楞蒙古自治州", "阿克苏地区", "克孜勒苏柯尔克孜自治州", "喀什地区", "和田地区", "伊犁哈萨克自治州", "塔城地区", "阿勒泰地区", "省直辖行政单位"]]
    window.city1Cid=1;
    window.city2Cid=1;
    var _getCityByCode=function(citycode){
        if(!citycode){
            return;
        }
        var lev1_index=0;
        var lev2_index=0;
        for(var i=0;i<lev1code.length;i++){
            if(citycode.indexOf(lev1code[i])==0){
                lev1_index=i;
            }
        }
        var cu_lev2code=lev2code[lev1_index];
        for(var j=0;j<cu_lev2code.length;j++){
            if(citycode==cu_lev2code[j]){
                lev2_index=j;
            }
        }
        return lev1[lev1_index]+' '+lev2[lev1_index][lev2_index]
    }
    function showlev1Temp(obj){
        var $obj=$(obj);
        if(!$obj.attr('city1Cid')){
            var newId="city1Cid"+window.city1Cid++;
            $obj.attr('city1Cid',newId);
            var lev1Temp='<div id="'+newId+'"style="position: absolute" class="i8city1"><ul>';
            for(var i=0;i<lev1.length;i++){
                lev1Temp+='<li lev1code="'+lev1code[i]+'">'+lev1[i]+'</li>'
            }
            lev1Temp+='</ul></div>';
            $('body').append(lev1Temp).find('.i8city1').mCustomScrollbar({//添加滚动条功能
                theme: "dark-thin"
            })
        }
        var _left=$obj.offset().left;
        var _top=$obj.offset().top+=$obj.height()+2;
        var _width=$obj.width();
        var city1Cid=$obj.attr('city1Cid');
        $('#'+city1Cid).css({'top':_top,'display':'block','left':_left,'width':_width});
        if($('#'+city1Cid).find('.select-city').length){
            var __top=$('#'+city1Cid).find('.select-city').position().top;
            $('#'+city1Cid).find('.mCSB_container').css('top',__top).mCustomScrollbar('update');
        }

    }
    function getCityLev2Index(str){
        var index=0;
        for(var i=0;i<lev1.length;i++){
            if(str==lev1[i]){
                index= i;
            }
        }
        return index;
    }
    function hidelev1Temp(obj){
        var $obj=$(obj);
        if($obj.attr('city1Cid')){
            var city1Cid=$obj.attr('city1Cid');
            $('#'+city1Cid).hide();
        }
    }
    function showlev2Temp(obj,str){
        var $obj=$(obj);
        var index=getCityLev2Index(str);
        var lev2Temp='';
        if(!$obj.attr('city2Cid')){
            var newId="city2Cid"+window.city2Cid++;
            $obj.attr('city2Cid',newId);
            var lev2Temp='<div class="i8city2" id="'+newId+'" style="position: absolute"><ul>';
            var whichlev2=lev2[index];
            for(var i=0;i<whichlev2.length;i++){
                lev2Temp+='<li lev2code="'+lev2code[index][i]+'">'+whichlev2[i]+'</li>'
            }
            lev2Temp+='</ul></div>';
            $('body').append(lev2Temp).find('.i8city2').mCustomScrollbar({//添加滚动条功能
                theme: "dark-thin"
            }).on('click','.mCSB_dragger_bar,.mCSB_dragger',function(){
                return false;
            });
        }else{
            var whichlev2=lev2[index];
            for(var i=0;i<whichlev2.length;i++){
                lev2Temp+='<li lev2code="'+lev2code[index][i]+'">'+whichlev2[i]+'</li>'
            }
            var cuId=$obj.attr('city2Cid');
            $('#'+cuId).find('ul').html(lev2Temp)
        }
        var _left=$obj.offset().left;
        var _top=$obj.offset().top+=$obj.height()+2;
        var city2Cid=$obj.attr('city2Cid');
        var _width=$obj.width();
        $('#'+city2Cid).css({'top':_top,'display':'block','left':_left,'width':_width});
        if($('#'+city2Cid).find('.select-city').length){
            var __top=$('#'+city2Cid).find('.select-city').position().top;
            $('#'+city2Cid).find('.mCSB_container').css('top',__top).mCustomScrollbar('update');
        }
    }
    //
    function cityupdate(citygroup,citycode){
        if(!citycode){
            return;
        }
        var lev1_index=0;
        var lev2_index=0;
        for(var i=0;i<lev1code.length;i++){
            if(citycode.indexOf(lev1code[i])==0){
                lev1_index=i;
            }
        }
        var cu_lev2code=lev2code[lev1_index];
        for(var j=0;j<cu_lev2code.length;j++){
            if(citycode==cu_lev2code[j]){
                lev2_index=j;
            }
        }
        $(citygroup).find('.citylev1').val(lev1[lev1_index]);
        $(citygroup).find('.citylev2').val(lev2[lev1_index][lev2_index]);
    }
    $('.city-group').each(function(){
        var citycode=$(this).attr('lev2code');
        cityupdate(this,citycode);
    })

    /*$(document).on('click','.citylev1',function(){
        $('.i8city2').hide();
        return false;
    })
    $(document).on('click','.citylev2',function(){
        $('.i8city1').hide();
        return false;
    })
    $(document).on('click',document,function(){
        $('.i8city1').hide();
        $('.i8city2').hide();
    })*/

    $(document).on('click','.mCSB_draggerContainer',function(){
          return false;
    });
    $(document).on('blur','.citylev1',function(){
        setTimeout(function(){
            //$('.i8city1').hide()
        },200)
    })
    $(document).on('blur','.citylev2',function(){
        setTimeout(function(){
            //$('.i8city2').hide()
        },200)
    })
    $(document).on('click',function(){
        $('.i8city2,.i8city1').hide()
    })
    $(document).on('focus','.citylev1',function(){
        var $this=$(this);
        showlev1Temp($this);
    })
    $(document).on('focus','.citylev2',function(){
        var $this=$(this);
        var group=$this.parents('.city-group').eq(0);
        if(!group.length){
            return;
        }
        var cityLev1=group.find('.citylev1');
        var _str= $.trim(cityLev1.val());
        showlev2Temp($this,_str);
    })

    $(document).on('click','.i8city1 li',function(){
        var $this=$(this);
        var hasSelected=false;
        if($this.hasClass('select-city')){
            hasSelected=true;
        }
        var i8city1=$(this).parents('.i8city1').eq(0);
        i8city1.find('li').removeClass('select-city');
        $this.addClass('select-city');
        i8city1.hide();
        var _id=i8city1.attr('id');
        var _val=$this.text();
        $('[city1Cid='+_id+']').val(_val);
        //开始控制2级城市
        var group=$('[city1Cid='+_id+']').parents('.city-group').eq(0);
        if(!group.length){
            return;
        }
        var cityLev2=group.find('.citylev2');
        if(hasSelected){
            return;
        }
        cityLev2.val('');
    })
    $(document).on('click','.i8city2 li',function(){
        var $this=$(this);
        var i8city2=$(this).parents('.i8city2').eq(0);
        i8city2.find('li').removeClass('select-city');
        $this.addClass('select-city');
        i8city2.hide();
        var _id=i8city2.attr('id');
        var _val=$this.text();
        $('[city2Cid='+_id+']').val(_val).parents('.city-group').eq(0).attr('lev2code',$this.attr('lev2code'));
    })
    exports.cityupdate=cityupdate;
    exports.getCityByCode=_getCityByCode;

})
